API/app/Controllers/ControladorOrdenes.php

    public function index()
    {
        //Se crea la instancia
        $ModeloOrdenes = new ModeloOrdenes();
        //Se recuperan los datos
        $Datos['ordenes'] = $ModeloOrdenes->findAll();
---
SELECT *
FROM `ordenes`