API/app/Controllers/ControladorLogin.php

    public function create()
    {
        //
        $ModeloLogin = new ModeloUsuarios();
        //
        $Datos = [
            'USUARIO' => $this->request->getVar('USUARIO'),
            'PASSWORD' => $this->request->getVar("PASSWORD")
        ];

        $Solicitud = $ModeloLogin->getWhere(['USUARIO' => $Datos['USUARIO']])->getRow();
---
SELECT *
FROM `usuarios`
WHERE `USUARIO` = 'ANGELICAIB23'