API/app/Controllers/ControladorProveedores.php

    public function index()
    {
        //Creamos la instancia
        $ModeloProveedores = new ModeloProveedores();
        //Se recuperan los registros de la tabla de proveedores
        $Datos['proveedores'] = $ModeloProveedores->findAll();
---
SELECT *
FROM `proveedores`