API/app/Controllers/ControladorDetalleOrdenes.php

SELECT *
FROM `detalle_orden`
---
    public function index()
    {
        //Se crea la instancia
        $ModeloDetalleOrdenes = new ModeloDetalleOrdenes();
        //Se recuperan los datos
        $Datos['detalle_orden'] = $ModeloDetalleOrdenes->findAll();

SELECT *
FROM `detalle_orden`
WHERE `ID_ORDEN` = '6'
---
    public function show($id = null)
    {
        //Se crea la instancia
        $ModeloDetalleOrdenes = new ModeloDetalleOrdenes();
        //Se recuperan datos por id
        $Datos = $ModeloDetalleOrdenes->getWhere(['ID_ORDEN' => $id])->getResult();