API/app/Controllers/ControladorProductos.php

SELECT *
FROM `productos`
---
    public function index()
    {
        //Se crea instancia
        $ModeloProductos = new ModeloProductos();
        //Se recuperan los registros de la tabla de proveedores
        $Datos['productos'] = $ModeloProductos->findAll();