API/app/Controllers/ControladorUsuarios.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        //Crear instancia
        $ModeloUsuarios = new ModeloUsuarios();
        //Se recuperan datos
        $Datos['usuarios'] = $ModeloUsuarios->findAll();